# Pandas

In [1]:
import pandas as pd
import numpy as np

## 1. Data frames

In [62]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

df = pd.DataFrame(data = data, columns = columns)

#Alternatively we can use a list of dictionaries to create a dataframe.


data_dict = [
    {
        "Make": "Nissan",
        "Model": "Stanza",
        "Year": 1991,
        "Engine HP": 138.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "sedan",
        "MSRP": 2000
    },
    {
        "Make": "Hyundai",
        "Model": "Sonata",
        "Year": 2017,
        "Engine HP": None,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "Sedan",
        "MSRP": 27150
    },
    
    #other dictionaries
   
]

#df = pd.DataFrame(data_dict)

#It prints the entire dataframe:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [63]:
df.head(n = 2)

#df.head() prints the first five rows of the data frame.

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

## 2. Series

Columns in a dataframe are called -> series

### 2.1. Accessing

In [4]:
col_name = "Year"

print(df.Make) #Only if the name does not contain spaces.

print("\n{}".format(df['Model']))

print("\n{}".format(df[col_name]))

df[["Make", "Model", "Year"]]

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

0      Stanza
1      Sonata
2       Elise
3      Acadia
4    Frontier
Name: Model, dtype: object

0    1991
1    2017
2    2010
3    2017
4    2017
Name: Year, dtype: int64

      Make     Model  Year
0   Nissan    Stanza  1991
1  Hyundai    Sonata  2017
2    Lotus     Elise  2010
3      GMC    Acadia  2017
4   Nissan  Frontier  2017

### 2.2. Adding, changing and removing

In [5]:
#Adding a column.

df['id'] = ["nis1", "hyu1", "lot2", "gmc1", "niss2"]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,nis1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,hyu1
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,lot2
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,gmc1
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,niss2

In [6]:
#Changing a column.

df['id'] = [1, 2, 3, 4, 5]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [7]:
#Deleting a column.

del df['id']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

### 2.3. Index

### 2.3.1. Introduction

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
#Accessing to column's names.

df.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

In [11]:
#Accesing to the first row (excluding the row corresponding to the column's names)

df.iloc[0]

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
Name: 0, dtype: object

In [12]:
df.iloc[[0, 1, 2]]

#Similar to df.head(n = 2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

### 2.3.2. Playing with dataframes

In [13]:
idx = np.arange(5)

np.random.seed(2)
np.random.shuffle(idx)

df.iloc[idx]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [14]:
df_new = df.iloc[idx]
df_new

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [15]:
df_new.iloc[[0, 1]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [16]:
df_new.index

Int64Index([2, 4, 1, 3, 0], dtype='int64')

In [17]:
df.loc[[0, 1]]  # WARNING: loc function.

#Accesing to the real indexes not to the new data frame indexes- Only for shuffled data frames
#because with not shuffled data frames would be the same.

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [18]:
df_new_beta = df_new

df_new_beta.reset_index(drop = True)

# WARNING: Not executing this function directly to df_new to have a shuffled dataframe 
#          for the following chapter (Splitting).

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

### 2.3.3. Splitting

In [19]:
n_train = 3
n_val = 1
n_test = 1

df_train = df_new.iloc[:n_train]
df_val = df_new.iloc[n_train:n_train+n_val]
df_test = df_new.iloc[n_train+n_val:]

#df_new = df.Make.copy()    #Returns a dataframe or series.
#df_new = df.Make.values    #Returns a numpy array.

df_new

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [20]:
df_train

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [21]:
df_val

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

In [22]:
df_test

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

## 3. Element-wise operations

In [23]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [24]:
((df["Engine HP"]*2) > 300)

0    False
1    False
2     True
3     True
4     True
Name: Engine HP, dtype: bool

In [25]:
(df["Year"] > 2000 ) & (df["Make"] == "Nissan")

0    False
1    False
2    False
3    False
4     True
dtype: bool

## 4. Filtering

In [26]:
df[df["Make"] == "Nissan"]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [27]:
df[(df["Year"] > 2000 ) & (df["Make"] == "Nissan")]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

## 5. String operations

In [28]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [29]:
df["Vehicle_Style"].str.lower().str.replace(" ", "")

0          sedan
1          sedan
2    convertible
3         4drsuv
4         pickup
Name: Vehicle_Style, dtype: object

In [30]:
df.columns.str.lower().str.replace(" ", "")

Index(['make', 'model', 'year', 'enginehp', 'enginecylinders',
       'transmissiontype', 'vehicle_style', 'msrp'],
      dtype='object')

In [31]:
df.dtypes

Make                  object
Model                 object
Year                   int64
Engine HP            float64
Engine Cylinders       int64
Transmission Type     object
Vehicle_Style         object
MSRP                   int64
dtype: object

In [32]:
df.dtypes.index

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

In [33]:
df.dtypes == "object"

Make                  True
Model                 True
Year                 False
Engine HP            False
Engine Cylinders     False
Transmission Type     True
Vehicle_Style         True
MSRP                 False
dtype: bool

In [34]:
df.dtypes[df.dtypes == "object"]

Make                 object
Model                object
Transmission Type    object
Vehicle_Style        object
dtype: object

In [35]:
list(df.dtypes[df.dtypes == "object"].index)

['Make', 'Model', 'Transmission Type', 'Vehicle_Style']

In [36]:
string_columns = df.dtypes[df.dtypes == "object"].index

for col in string_columns:
    df[col] = df[col].str.lower().str.replace(" ", "")
    
df.columns = df.columns.str.lower().str.replace(" ", "")

In [37]:
df

,make,model,year,enginehp,enginecylinders,transmissiontype,vehicle_style,msrp
0,nissan,stanza,1991,138.0,4,manual,sedan,2000
1,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
2,lotus,elise,2010,218.0,4,manual,convertible,54990
3,gmc,acadia,2017,194.0,4,automatic,4drsuv,34450
4,nissan,frontier,2017,261.0,6,manual,pickup,32340

## 6. Summarizing operations

### 6.1. Numerical columns

In [38]:
print("{}".format(df.msrp))

print("\nMean: {}".format(df.msrp.mean()))
print("Min: {}".format(df.msrp.min()))
print("Max: {}".format(df.msrp.max()))
print("Std: {}".format(df.msrp.std()))
print("Sum: {}".format(df.msrp.sum()))

0     2000
1    27150
2    54990
3    34450
4    32340
Name: msrp, dtype: int64

Mean: 30186.0
Min: 2000
Max: 54990
Std: 18985.044903818372
Sum: 150930

In [39]:
df.msrp.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: msrp, dtype: float64

In [40]:
df.describe().round(2)

          year  enginehp  enginecylinders      msrp
count     5.00      4.00             5.00      5.00
mean   2010.40    202.75             4.40  30186.00
std      11.26     51.30             0.89  18985.04
min    1991.00    138.00             4.00   2000.00
25%    2010.00    180.00             4.00  27150.00
50%    2017.00    206.00             4.00  32340.00
75%    2017.00    228.75             4.00  34450.00
max    2017.00    261.00             6.00  54990.00

### 6.2. Categorical

In [41]:
#Number of different values.

df.nunique()

make                4
model               5
year                3
enginehp            4
enginecylinders     2
transmissiontype    2
vehicle_style       4
msrp                5
dtype: int64

In [42]:
df.msrp.nunique()

5

In [43]:
df.make.value_counts()

nissan     2
hyundai    1
lotus      1
gmc        1
Name: make, dtype: int64

## 7. Missing values

In [44]:
df.isnull()

,make,model,year,enginehp,enginecylinders,transmissiontype,vehicle_style,msrp
0,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [45]:
df.isnull().sum()

make                0
model               0
year                0
enginehp            1
enginecylinders     0
transmissiontype    0
vehicle_style       0
msrp                0
dtype: int64

In [46]:
df.enginehp.fillna(0)

0    138.0
1      0.0
2    218.0
3    194.0
4    261.0
Name: enginehp, dtype: float64

In [47]:
df.enginehp.fillna(df.enginehp.mean())

0    138.00
1    202.75
2    218.00
3    194.00
4    261.00
Name: enginehp, dtype: float64

In [48]:
df.enginehp = df.enginehp.fillna(df.enginehp.mean())

df

,make,model,year,enginehp,enginecylinders,transmissiontype,vehicle_style,msrp
0,nissan,stanza,1991,138.00,4,manual,sedan,2000
1,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
2,lotus,elise,2010,218.00,4,manual,convertible,54990
3,gmc,acadia,2017,194.00,4,automatic,4drsuv,34450
4,nissan,frontier,2017,261.00,6,manual,pickup,32340

## 8. Sorting and re-ording

In [49]:
df

,make,model,year,enginehp,enginecylinders,transmissiontype,vehicle_style,msrp
0,nissan,stanza,1991,138.00,4,manual,sedan,2000
1,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
2,lotus,elise,2010,218.00,4,manual,convertible,54990
3,gmc,acadia,2017,194.00,4,automatic,4drsuv,34450
4,nissan,frontier,2017,261.00,6,manual,pickup,32340

In [50]:
df.sort_values(by = "msrp")

,make,model,year,enginehp,enginecylinders,transmissiontype,vehicle_style,msrp
0,nissan,stanza,1991,138.00,4,manual,sedan,2000
1,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
4,nissan,frontier,2017,261.00,6,manual,pickup,32340
3,gmc,acadia,2017,194.00,4,automatic,4drsuv,34450
2,lotus,elise,2010,218.00,4,manual,convertible,54990

In [51]:
df.sort_values(by =  "msrp", ascending = False)

,make,model,year,enginehp,enginecylinders,transmissiontype,vehicle_style,msrp
2,lotus,elise,2010,218.00,4,manual,convertible,54990
3,gmc,acadia,2017,194.00,4,automatic,4drsuv,34450
4,nissan,frontier,2017,261.00,6,manual,pickup,32340
1,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
0,nissan,stanza,1991,138.00,4,manual,sedan,2000

## 9. Grouping

In [52]:
df.groupby("transmissiontype").msrp.mean().round(2)

transmissiontype
automatic    30800.00
manual       29776.67
Name: msrp, dtype: float64

In [53]:
df.groupby("transmissiontype").msrp.agg(["mean", "count"])

                          mean  count
transmissiontype
automatic         30800.000000      2
manual            29776.666667      3

In [54]:
df_group = df.groupby("transmissiontype").msrp.agg(["mean", "count"])

df_group

                          mean  count
transmissiontype
automatic         30800.000000      2
manual            29776.666667      3

In [55]:
df_group["mean"] - df.msrp.mean()

transmissiontype
automatic    614.000000
manual      -409.333333
Name: mean, dtype: float64

## 10. Getting the NumPy array

In [56]:
df.msrp

0     2000
1    27150
2    54990
3    34450
4    32340
Name: msrp, dtype: int64

In [57]:
df.msrp.values

array([ 2000, 27150, 54990, 34450, 32340])

In [58]:
np.log1p(df.msrp).round(2)  #A dataframe is obtained.

0     7.60
1    10.21
2    10.91
3    10.45
4    10.38
Name: msrp, dtype: float64

In [59]:
np.log1p(df.msrp.values)  #ANumPy array is obtained.

array([ 7.60140233, 10.20916916, 10.91492481, 10.4472933 , 10.38409105])

## 11. Convert to dics

In [60]:
df

,make,model,year,enginehp,enginecylinders,transmissiontype,vehicle_style,msrp
0,nissan,stanza,1991,138.00,4,manual,sedan,2000
1,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
2,lotus,elise,2010,218.00,4,manual,convertible,54990
3,gmc,acadia,2017,194.00,4,automatic,4drsuv,34450
4,nissan,frontier,2017,261.00,6,manual,pickup,32340

In [61]:
df.to_dict("index")

{0: {'make': 'nissan',
  'model': 'stanza',
  'year': 1991,
  'enginehp': 138.0,
  'enginecylinders': 4,
  'transmissiontype': 'manual',
  'vehicle_style': 'sedan',
  'msrp': 2000},
 1: {'make': 'hyundai',
  'model': 'sonata',
  'year': 2017,
  'enginehp': 202.75,
  'enginecylinders': 4,
  'transmissiontype': 'automatic',
  'vehicle_style': 'sedan',
  'msrp': 27150},
 2: {'make': 'lotus',
  'model': 'elise',
  'year': 2010,
  'enginehp': 218.0,
  'enginecylinders': 4,
  'transmissiontype': 'manual',
  'vehicle_style': 'convertible',
  'msrp': 54990},
 3: {'make': 'gmc',
  'model': 'acadia',
  'year': 2017,
  'enginehp': 194.0,
  'enginecylinders': 4,
  'transmissiontype': 'automatic',
  'vehicle_style': '4drsuv',
  'msrp': 34450},
 4: {'make': 'nissan',
  'model': 'frontier',
  'year': 2017,
  'enginehp': 261.0,
  'enginecylinders': 6,
  'transmissiontype': 'manual',
  'vehicle_style': 'pickup',
  'msrp': 32340}}